const MajorToSubfieldMap = {
    // 文學院
    "中國文學系": "語文學門",
    "外國語文學系": "語文學門",
    "歷史學系": "人文學門",
    "哲學系": "人文學門",
    "人類學系": "人文學門",
    "圖書資訊學系": "新聞學及圖書資訊學門",
    "日本語文學系": "語文學門",
    "戲劇學系": "藝術學門",

    // 理學院
    "數學系": "數學及統計學門",
    "物理學系": "物理、化學及地球科學學門",
    "化學系": "物理、化學及地球科學學門",
    "地質科學系": "物理、化學及地球科學學門",
    "心理學系": "社會及行為科學學門",
    "地理環境資源學系": "社會及行為科學學門",
    "大氣科學系": "物理、化學及地球科學學門",

    // 社會科學院
    "政治學系": "社會及行為科學學門",
    "經濟學系": "社會及行為科學學門",
    "社會學系": "社會及行為科學學門",
    "社會工作學系": "社會福利學門",

    // 醫學院
    "醫學系": "醫藥衛生學門",
    "護理學系": "醫藥衛生學門",
    "醫學檢驗暨生物技術學系": "醫藥衛生學門",
    "物理治療學系": "醫藥衛生學門",
    "職能治療學系": "醫藥衛生學門",
    "藥學系": "醫藥衛生學門",

    // 工學院
    "土木工程學系": "建築及營建工程學門",
    "機械工程學系": "工程及工程業學門",
    "化學工程學系": "工程及工程業學門",
    "工程科學及海洋工程學系": "工程及工程業學門",
    "材料科學與工程學系": "工程及工程業學門",
    "醫學工程學系": "工程及工程業學門",

    // 生物資源暨農學院
    "農藝學系": "農業學門",
    "生物環境系統工程學系": "工程及工程業學門",
    "農業化學系": "農業學門",
    "森林環境暨資源學系": "林業學門", 
    "動物科學技術學系": "農業學門",
    "農業經濟學系": "農業學門",
    "園藝暨景觀學系": "農業學門",
    "生物產業傳播暨發展學系": "農業學門",
    "生物機電工程學系": "工程及工程業學門",
    "昆蟲學系": "生命科學學門",
    "植物病理與微生物學系": "農業學門",
    "獸醫學系": "獸醫學門",

    // 管理學院
    "工商管理學系": "商業及管理學門",
    "會計學系": "商業及管理學門",
    "財務金融學系": "商業及管理學門",
    "國際企業學系": "商業及管理學門",
    "資訊管理學系": "資訊通訊科技學門",

    // 公共衛生學院
    "公共衛生學系": "醫藥衛生學門",

    // 電機資訊學院
    "電機工程學系": "工程及工程業學門",
    "資訊工程學系": "資訊通訊科技學門",

    // 法律學院
    "法律學系": "法律學門",
    
    // 生命科學院
    "生命科學系": "生命科學學門",
    "生化科技學系": "生命科學學門"
}

module.exports = { MajorToSubfieldMap }